<HTML>
<HEAD>
<LINK HREF="../../../mrsystem.css" REL="stylesheet">
<TITLE>Konfiguration</TITLE>
</HEAD>
<BODY>
<DIV CLASS="odiv">
<H1>Konfiguration</H1>
</DIV>
<P>
Die Seite mit dem Men&uuml; f&uuml;r die Konfiguration enth&auml;lt
Eintr&auml;ge f&uuml;r die Konfiguration der <VAR>mrsystem</VAR> Software,
des Status der Ger&auml;te am CAN Bus, der Systemkonfiguration, ..., das
Eoinspielen von Updates und Neustart des <VAR>mrsystem</VAR>, des Ger&auml;ts
und dem Shutdown des Ger&auml;ts.
<P>
<IMG SRC="web_menu_cfg.gif">
<P>
<DIV CLASS="odiv">
<H2>mrsystem Konfiguration</H2>
</DIV>
<P>
Der Tab <VAR>MR-System</VAR> erlaubt es das Verhalten der Software festzulegen.
Das Formular ist damit ein Editor f&uuml;r die
<A HREF="mrsystem.htm">/etc/mrsystem</A> Datei.
<P>
<IMG SRC="web_mrsystem.gif">
<P>
Der Tab <VAR>Start</VAR> erlaubt es festzulegen, welche Komponenten der
Software gestartet werden sollen. Damit wird das Verhalten bestimmt und die
Software an die vorhandenen Schnittstellen angepa&szlig;t. Das Formular ist
damit ein Editor f&uuml;r die <A HREF="mrstart.htm">/etc/mrstart</A> Datei.
<P>
<IMG SRC="web_mrstart.gif">
<P>
Der Tab <VAR>Spezial-Lok</VAR> erlaubt es festzulegen, welche Aktionen
ausgef&uuml;hrt werden sollen, wenn eine Funktion einer Lok mit vorgegebener
Adresse und Namen ausgef&uuml;hrt werden sollen. Das Formular ist damit ein
Editor f&uuml;r die <A HREF="mrlok.htm">/etc/mrlok</A> Datei.
<P>
<IMG SRC="web_mrlok.gif">
<P>
<DIV CLASS="odiv">
<H2>CAN Ger&auml;te / Messwerte / Konfiguration</H2>
</DIV>
<P>
Die Seite mit dem Men&uuml; f&uuml;r die CAN Ger&auml;te enth&auml;lt
Eintr&auml;ge f&uuml;r eine &Uuml;bersicht der Ger&auml;te, deren Messwerte
und die Konfiguration der Ger&auml;te (soweit vorhanden).
<P>
<IMG SRC="web_menu_status.gif">
<P>
<DIV CLASS="odiv">
<H3>CAN Ger&auml;te</H3>
</DIV>
<P>
Dieser Tab zeigt als Beispiel ein MS2 am CAN Bus.
<P>
<IMG SRC="web_member_ms2.gif">
<P>
Dieser Tab zeigt als Beispiel die Gleisbox am CAN Bus.
<P>
<IMG SRC="web_member_gb.gif">
<P>
<DIV CLASS="odiv">
<H3>Messwerte der CAN Ger&auml;te</H3>
</DIV>
<P>
Dieser Tab zeigt als Beispiel die Messwerte der Gleisbox.
<P>
<IMG SRC="web_messwert.gif">
<P>
<HR>
<P>
<CENTER>
<A HREF="bbb.htm">Zur&uuml;ck zum BBB</A> -
<A HREF="index.htm">Zur&uuml;ck zur Modellbahn Startseite</A> -
<A HREF="../index.htm">Zur&uuml;ck zur Homepage</A>
</CENTER>
</BODY>
</HTML>
